# Задача 1
# Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
#
# Выведите все элементы, которые меньше 5.
#Мой вариант
#_______________________________________________________________________________________
import numpy

def Array_A(Array_a):
    Array_a=numpy.array(Array_a)
    Array_a = numpy.fromiter((i for i in Array_a if i < 5), dtype = (Array_a.dtype.descr[0][1], len(Array_a.shape)))
    return Array_a
if __name__ == "__main__":
    S=[1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
    Array_A(S)

#Первый вариант решения от сайта
#_______________________________________________________________________________________
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
for elem in a:
    if elem < 5:
        print(elem)

#Второй вариант решения от сайта
#_______________________________________________________________________________________
print(list(filter(lambda x : x<5,a)))

#Третий вариант решения от сайта
#_______________________________________________________________________________________
print([elem for elem in a if elem < 5])