# Задача 2
# Даны списки:
#
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
#
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
#
# Нужно вернуть список, который состоит из элементов, общих для этих двух списков.

#Мой вариант
#_______________________________________________________________________________________
import numpy

def Arrays_A_B(a,b):
    a = numpy.array(a)
    b = numpy.array(b)
    print(numpy.intersect1d(a, b))

    print(numpy.intersect1d(numpy.array([1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]), numpy.array([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13])))

    print([z for z in b if a.count(z)>0])

if __name__ == "__main__":
    a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
    b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
    Arrays_A_B(a=a, b=b)